<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    	<string>Find and download the newest version of SWITCHdrive</string>
    <key>Identifier</key>
    <string>com.github.its-unibas.download.switchdrive</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SWITCHdrive</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://help.switch.ch/drive/downloads/</string>
                <key>re_pattern</key>
                <string>(https://misc.www.switch.ch/drive/SWITCHdrive-[\d.]+pkg)</string>
            </dict>
        </dict>
	<dict>
            <key>Processor</key>
            <string>URLDownloader</string>
	    <key>Arguments</key>
	    <dict>
		<key>url</key>
		<string>%match%</string>
	    </dict>	
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
		<key>expected_authority_names</key>
		<array>
			<string>Developer ID Installer: ownCloud Inc. (9B5WD74GWJ)</string>
			<string>Developer ID Certification Authority</string>
			<string>Apple Root CA</string>
		</array>
	    </dict>
        </dict>
    </array>
</dict>
</plist>
