<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    	<string>Find and download the newest version of SWITCHcast. Currently, none of the contained Apps are signed.</string>
    <key>Identifier</key>
    <string>com.github.its-unibas.download.switchcast</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SWITCHcast</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://help.switch.ch/cast/recording/switchcast-recorder/download/</string>
                <key>re_pattern</key>
                <string>(https://misc.www.switch.ch/cast/SWITCHcastRecorder[\d_]+.zip)</string>
            </dict>
        </dict>
	<dict>
            <key>Processor</key>
            <string>URLDownloader</string>
	    <key>Arguments</key>
	    <dict>
		<key>url</key>
		<string>%match%</string>
	    </dict>	
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
