<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Repackage SWITCHcast Recorder to remove pre/post scripts.
We have to unpack to packages to do this. Therefore, we create our pkgroot first and to the unpackaging later.</string>
	<key>Identifier</key>
	<string>com.github.its-unibas.pkg.switchcastrecorder</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SWITCHdrive Recorder</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.its-unibas.download.switchcast</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unarchive</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/pkg/%NAME%</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Applications/SWITCHcast Recorder.app/</string>
					<string>/Library/LaunchAgents/ch.switch.SWITCHcast.CalendarAgent.plist</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
		</dict>
	</array>
</dict>
</plist>
