<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Repackage SWITCHcast Recorder to remove pre/post scripts.
We have to unpack to packages to do this. Therefore, we create our pkgroot first and to the unpackaging later.</string>
    <key>Identifier</key>
    <string>com.github.its-unibas.pkg.switchcastrecorder</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SWITCHdrive Recorder</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.its-unibas.download.switchcast</string>
    <key>Process</key>
    <array>
	<dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/pkg/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                    <key>Library</key>
                    <string>0755</string>
                    <key>Library/LaunchAgents</key>
                    <string>0755</string>
                </dict>
            </dict>
        </dict>
	<dict>
            <key>Processor</key>
            <string>Unarchiver</string>
	    <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unarchive</string>
                <key>purge_destination</key>
                <true/>
            </dict>
	</dict>
	<dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
	    <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/unarchive/SWITCHcast Recorder.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpacked</string>
                <key>purge_destination</key>
                <true/>
            </dict>
	</dict>
	<dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/app_unpacked</string>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpacked/SWITCHcast_Recorder.pkg/Payload</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/app_unpacked/Applications/SWITCHcast Recorder.app/Contents/Info.plist</string>
		<key>plist_version_key</key>
                <string>CFBundleVersion</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/app_unpacked/Applications/SWITCHcast Recorder.app</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/pkg/%NAME%/Applications/SWITCHcast Recorder.app</string>
            </dict>
        </dict>
	<dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/daemon_unpacked</string>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpacked/SWITCHcast_CalendarAgent.pkg/Payload</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/daemon_unpacked/Library/LaunchAgents/ch.switch.SWITCHcast.CalendarAgent.plist</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/pkg/%NAME%/Library/LaunchAgents/ch.switch.SWITCHcast.CalendarAgent.plist</string>
            </dict>
        </dict>
	<dict>
            <key>Processor</key>
            <string>MunkiInstallsItemsCreator</string>
            <key>Arguments</key>
            <dict>
		<key>faux_root</key>
		<string>%RECIPE_CACHE_DIR%/pkg/%NAME%</string>
                <key>installs_item_paths</key>
                <array>
                    <string>/Applications/SWITCHcast Recorder.app/</string>
                    <string>/Library/LaunchAgents/ch.switch.SWITCHcast.CalendarAgent.plist</string>
                </array>
            </dict>
        </dict>
	<dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
		<key>pkgname</key>
		<string>%NAME%-%version%</string>
		<key>pkg_request</key>
		<dict>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>id</key>
                    <string>ch.switch.cast.recorder.pkg</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>/</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
   </array>
</dict>
</plist>
