<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.1.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest updates for CorelDRAW and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.its-unibas.munki.CorelDRAWUpdate</string>
	<key>Input</key>
	<dict>
		<key>BASE_VERSION_NAME</key>
		<string>CorelDRAW Graphics Suite</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>CorelDRAWUpdate</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Corel Font Manager 2019.app</string>
				<string>Corel PHOTO-PAINT 2019.app</string>
				<string>CorelDRAW 2019.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Creativity</string>
			<key>description</key>
			<string>Find all the professional vector illustration, layout, photo editing and design tools you need to work faster, smarter, and in more places with this superior graphic design software.</string>
			<key>developer</key>
			<string>Corel Corporation.</string>
			<key>display_name</key>
			<string>CorelDRAW Update</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>update_for</key>
			<array>
				<string>%BASE_VERSION_NAME%</string>
			</array>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.its-unibas.download.CorelDRAWUpdate</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
