<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of MAXQDA2018 and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.its-unibas.munki.MAXQDA2018</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MAXQDA2020</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>Productivity</string>
            <key>description</key>
            <string>MAXQDA ist eine Software für qualitative Datenanalyse und Mixed Methods Forschung.</string> 
            <key>developer</key>
            <string>VERBI Software GMBH</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>minimum_os_version</key>
            <string>10.12.0</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true />
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.2</string>
    <key>ParentRecipe</key>
    <string>com.github.its-unibas.download.MAXQDA2018</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>