<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download Recipe for the latest version of MAXQDA2020</string>
    <key>Identifier</key>
    <string>com.github.its-unibas.download.MAXQDA2020</string>
    <key>Input</key>
    <dict>
        <key>VERSION</key>
        <string>2020</string>
        <key>NAME</key>
        <string>MAXQDA2020</string>
        <key>URL</key>
        <string>http://www.maxqda.de/updates/%VERSION%/MAXQDA%VERSION%.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.2</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/%NAME%.app</string>
            </dict>
            
        </dict>
    </array>
</dict>
</plist>