<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.its-unibas.munki.PyCharmProfessional</string>
	<key>Input</key>
	<dict>
		<key>CODESIGNATUREAPPNAME</key>
		<string>PyCharm.app</string>
		<key>CODESIGNATUREREQUIREMENT</key>
		<string>identifier "com.jetbrains.pycharm" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2ZEFAR8TH3"</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/JetBrains/PyCharm</string>
		<key>NAME</key>
		<string>PyCharmProfessional</string>
		<key>edition</key>
		<string>professional</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>PyCharm provides smart code completion, code inspections, on-the-fly error highlighting and quick-fixes, along with automated code refactorings and rich navigation capabilities. </string>
			<key>display_name</key>
			<string>PyCharm Professional Edition</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.its-unibas.munki.PyCharm</string>
</dict>
</plist>
