<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of PyMOL.</string>
	<key>Identifier</key>
	<string>com.github.its-unibas.download.PyMOL</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>PyMOL</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>https://.*/installers/PyMOL-[0-9].*-MacOS.dmg</string>
				<key>url</key>
				<string>https://pymol.org/2/</string>
			</dict>
			<key>Processor</key>
			<string>CURLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>%match%</string>
			</dict>
			<key>Processor</key>
			<string>CURLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/PyMOL.dmg/PyMOL.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "com.schrodinger.pymol" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "26SDDJ756N")</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
