<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Elasticsearch Filebeat. If any other Elasticsearch beat wants to be downloaded the NAME input variable can be changed.</string>
	<key>Identifier</key>
	<string>com.github.its-unibas.download.filebeat</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>filebeat</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.2</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.elastic.co/downloads/beats/%NAME%</string>
				<key>re_pattern</key>
				<string>(?P&lt;url&gt;https://artifacts.elastic.co/downloads/beats/%NAME%/%NAME%-(?P&lt;version&gt;[\d\.]+)-darwin-x86_64\.tar\.gz)</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%-darwin-x86_64.tar.gz</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://artifacts.elastic.co/downloads/beats/%NAME%/%NAME%-%version%-darwin-x86_64.tar.gz.sha512</string>
				<key>re_pattern</key>
				<string>(?P&lt;checksum&gt;\w+)</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>io.github.hjuutilainen.SharedProcessors/ChecksumVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>algorithm</key>
				<string>SHA512</string>
				<key>checksum</key>
				<string>%checksum%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>